# writing excel -----------------------------------------------------------
result = c(fore) #读取结果
# 数据
fileout = "2017011016_吕睿可_STLF_DATA_OUT_2.xls"
data_out_r1 = c('学号','姓名','班级','考核方式',"预测日期","时段1","时段2","时段3","时段4","时段5","时段6","时段7","时段8","时段9","时段10","时段11","时段12","时段13","时段14","时段15","时段16","时段17","时段18","时段19","时段20","时段21","时段22","时段23","时段24","时段25","时段26","时段27","时段28","时段29","时段30","时段31","时段32","时段33","时段34","时段35","时段36","时段37","时段38","时段39","时段40","时段41","时段42","时段43","时段44","时段45","时段46","时段47","时段48","时段49","时段50","时段51","时段52","时段53","时段54","时段55","时段56","时段57","时段58","时段59","时段60","时段61","时段62","时段63","时段64","时段65","时段66","时段67","时段68","时段69","时段70","时段71","时段72","时段73","时段74","时段75","时段76","时段77","时段78","时段79","时段80","时段81","时段82","时段83","时段84","时段85","时段86","时段87","时段88","时段89","时段90","时段91","时段92","时段93","时段94","时段95","时段96")
data_out_r2 = c(2017011016,"吕睿可","电75","2B","20080606",result)
data_out = t(matrix(c(data_out_r1,data_out_r2),length(data_out_r1)))

#生成工作簿来存数据
wb <- xlsx::createWorkbook(type = "xls")
sheet <- createSheet(wb,sheetName = "Sheet1")
addDataFrame(data_out,sheet,row.names = F,col.names = F)
saveWorkbook(wb,fileout)
